---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarMovedBarsOverlapped
source: html/92a6df6d-655c-37fa-fc0e-633b1da91a96.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarMovedBarsOverlapped Property

There are identical overlapping bars in the rebar set. This will result in double counting in schedules.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarMovedBarsOverlapped { get; }
```